v2206/test_MRF_stirred_tank/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    top
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          1264;
        startFace       246320;
    }
    impeller
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2368;
        startFace       247584;
    }
    vessel
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6637;
        startFace       249952;
    }
)

// ************************************************************************* //
