v2206/test_MRF_stirred_tank/constant/transportProperties:Zone.Identifier
[ZoneTransfer]
ZoneId=3
ReferrerUrl=C:\Users\Admin\OneDrive - uibk.ac.at\Desktop\MRF_stirred_tank.zip
